export const TermsOfService = () => {
  return (
    <main className='text-gray-800'>
      <div>
        <p>
          本利用規約（以下「本規約」といいます）は、合瀬雄紀（以下「運営者」といいます）が本ウェブサイト上で提供するサービス（以下「本サービス」といいます）の利用条件を定めるものです。
          本サービスのユーザー（以下「利用者」といいます）は、本規約に同意した上で、本サービスをご利用いただきます。
        </p>
      </div>
      <div className='my-12'>
        <h2 className='mb-4 text-xl'>第1条（規約の範囲）</h2>
        <p>
          本規約は、本サービスの提供条件および運営者と利用者との間の権利・義務関係を定めることを目的としています。
          本規約は利用者と運営者との間のサービスの利用に関わる一切の関係に適用されるものとします。
        </p>
      </div>
      <div className='my-12'>
        <h2 className='mb-4 text-xl'>第2条（利用資格）</h2>
        <p>本サービスは以下の条件をすべて満たす方に限りご利用いただくことができます。</p>
        <ol className='mt-6 list-outside list-decimal space-y-4 pl-6'>
          <li>本規約に同意する方</li>
          <li>過去に本規約に違反したことのない方</li>
        </ol>
      </div>
      <div className='my-12'>
        <h2 className='mb-4 text-xl'>第3条（禁止事項）</h2>
        <p>利用者は、本サービスの利用にあたり、以下の行為をしてはなりません。</p>
        <ol className='my-6 list-outside list-decimal space-y-4 pl-6'>
          <li>法令または公序良俗に違反する行為</li>
          <li>犯罪行為に関連する行為</li>
          <li>裁判所の判決や命令に違反する行為</li>
          <li>他者になりすます行為</li>
          <li>何らかの手段により、他者の個人情報等を収集する行為</li>
          <li>他者を欺く虚偽の内容を記載する行為</li>
          <li>認証情報の使用権限を第三者に譲渡または貸与する行為</li>
          <li>本サービスのサーバーやネットワークのシステムに意図的に支障を与える行為</li>
          <li>本サービスの運営を妨害する行為、または妨害するおそれのある行為</li>
          <li>本サービスの提供する機能を介さずに直接APIサーバーに繰り返しアクセスする行為</li>
          <li>反社会的勢力に対して直接的あるいは間接的に利益を供与する行為</li>
          <li>
            本サービスの利用者、運営会社あるいは第三者の知的財産権、肖像権、プライバシー、名誉その他の権利を侵害する行為
          </li>
          <li>
            過度に暴力的な表現、露骨な性的表現、人種、国籍、信条、性別、社会的身分、門地等による差別につながる表現、自殺、自傷行為、薬物の不適切な利用を助長する表現、他人に不快感を与える表現等、不適切な内容を投稿する行為
          </li>
          <li>他者に対する嫌がらせや誹謗中傷、ストーキングなどの行為</li>
          <li>宗教活動または宗教団体への勧誘行為</li>
          <li>その他、前各号に準ずる不適切な行為</li>
        </ol>
        <p>
          利用者が前項のいずれかに該当する行為を行ったと運営者が判断した場合、当該コンテンツの削除、あるいはその利用者のアカウントを停止・削除する場合があります。
          この場合、運営者はこれらの措置を講じた理由を開示する義務を負いません。
        </p>
      </div>
      <div className='my-12'>
        <h2 className='mb-4 text-xl'>第4条（著作権等）</h2>
        <ol className='my-6 list-outside list-decimal space-y-4 pl-6'>
          <li>
            利用者は、自ら著作権等の必要な知的財産権を有するか、または権利者から必要な許諾を受けた画像等の著作物のみ、本サービスを利用して投稿および編集できるものとします。
          </li>
          <li>
            利用者が本サービスを利用して投稿した絵画等のコンテンツ（以下「利用者コンテンツ」といいます）につき生じる著作権については、当該利用者あるいはその権利者に留保されるものとします。
          </li>
          <li>
            利用者または第三者は、利用者コンテンツについて、権利者の許可を得ることなく、無断で転載または二次配布等を行うことはできません。
          </li>
          <li>
            利用者は、運営者が利用者コンテンツを本ウェブサイトに掲載し、これを配信（公衆送信および送信可能化することを含みます）することを許諾するものとします。
          </li>
        </ol>
      </div>
      <div className='my-12'>
        <h2 className='mb-4 text-xl'>第5条（認証情報の管理）</h2>
        <p className='my-6'>
          利用者は、本サービスのアカウントの作成にあたって登録するメールアドレスおよび認証情報を自己の責任において適切に管理および保管するものとします。
          利用者が本サービスのアカウントに登録したメールアドレスへのアクセスができなくなった場合、本サービスへのログインができなくなることがあります。
        </p>
        <p className='my-6'>
          利用者が本サービスのアカウント登録にあたって認証情報として利用する、運営者以外の者が運営するサービス（以下「外部サービス」といいます）の登録および利用については、当該外部サービスが規定する各規約の定めに従い、利用者自身の責任で行うものとします。
          認証情報の管理不十分、第三者の使用等によって生じた損害または不利益については利用者が責任を負うものとし、運営者は一切の責任を負いません。
        </p>
      </div>
      <div className='my-12'>
        <h2 className='mb-4 text-xl'>第6条（広告の掲載）</h2>
        <p className='my-6'>
          運営者は、第三者の広告を本サービス上に掲載することができるものとします。
        </p>
      </div>
      <div className='my-12'>
        <h2 className='mb-4 text-xl'>第7条（退会）</h2>
        <p className='my-6'>
          利用者は所定の方法に従って手続きを行うことにより、いつでもアカウントを削除することができます。
          アカウントの削除後は、過去に本サービスに投稿されたコンテンツおよびアカウントに紐づくデータにアクセスすることはできなくなります。
        </p>
        <p className='my-6'>
          アカウントの削除に伴い利用者に生じる損失または不利益について、運営者は責任を負わないものとします。
        </p>
      </div>
      <div className='my-12'>
        <h2 className='mb-4 text-xl'>第8条（サービス内容の変更・停止）</h2>
        <p className='my-6'>
          運営者は、利用者に通知することなく、本サービスの内容の変更および一部機能の停止をすることができるものとし、これによって利用者に生じた損害または不利益について一切の責任を負いません。
        </p>
      </div>
      <div className='my-12'>
        <h2 className='mb-4 text-xl'>第9条（免責事項）</h2>
        <ol className='my-6 list-outside list-decimal space-y-4 pl-6'>
          <li>
            運営者は、本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます）がないことを明示的にも黙示的にも保証しておりません。
          </li>
          <li>
            運営者は、本サービスの利用により生じたあらゆる損害や不利益について一切の責任を負わないものとします。
            ただし、運営会社と利用者との契約が消費者契約法に定める消費者契約にあたる場合、この免責規定は適用されません。
          </li>
        </ol>
      </div>
      <div className='my-12'>
        <h2 className='mb-4 text-xl'>第10条（利用規約の変更）</h2>
        <ol className='my-6 list-outside list-decimal space-y-4 pl-6'>
          <li>
            運営者は、利用者に通知または本ウェブサイト上で告知することにより、本サービスの本利用規約を変更することができます
          </li>
          <li>
            運営者は、本規約および本サービスの内容の変更により生じたいかなる損害や不利益について責任を負いません
          </li>
        </ol>
      </div>
      <div className='my-12'>
        <h2 className='mb-4 text-xl'>第11条（準拠法・裁判管轄）</h2>
        <p className='my-6'>
          本規約の解釈にあたっては、日本法を準拠法とします。
          本サービスに関して紛争が生じた場合には、運営者の所在地を管轄する裁判所を第一審の専属的合意管轄裁判所とします。
        </p>
      </div>
      <div className='float-right'>
        <p>2024年12月24日 制定</p>
      </div>
    </main>
  )
}
